	IDENTIFICATION DIVISION.
	 PROGRAM-ID. ALTAS-ALQUILERES.
	ENVIRONMENT DIVISION.
	 INPUT-OUTPUT SECTION.
	 FILE-CONTROL.
	      SELECT OPTIONAL ALQUILER ASSIGN TO DISK "ALQUILER.DAT"
	      ORGANIZATION IS INDEXED
	      ACCESS MODE IS DYNAMIC
	      RECORD KEY IS N-SALIDA
	      ALTERNATE RECORD KEY IS CODI-SOCIO
	      ALTERNATE RECORD KEY IS CODI-PELI
	      FILE STATUS IS ESTADO-ALQUILER.

	      SELECT OPTIONAL PELICULA ASSIGN TO DISK "PELICULA.DAT"
	      ORGANIZATION IS INDEXED
	      ACCESS MODE IS DYNAMIC
	      RECORD KEY IS COD-PELI
	      ALTERNATE RECORD KEY IS TITULO
	      ALTERNATE RECORD KEY IS GENERO
	      ALTERNATE RECORD KEY IS DIRECTOR
	      FILE STATUS IS ESTADO-PELICULA.
	
	
	DATA DIVISION.
	 FILE SECTION.
	  FD ALQUILER LABEL RECORD STANDARD.
	  01 REG-ALQUILER.
	   02 N-SALIDA PIC X(8).
	   02 FECHA-ALQ.
	    03 DIA PIC 99.
	    03 MES PIC 99.
	    03 ANO PIC 9999.
	   02 CODI-SOCIO PIC X(5).
	   02 CODI-PELI PIC X(6).
	   02 PRECI-ALQ PIC 9(4).
	   02 DEVUELTA PIC X.

	  FD PELICULA LABEL RECORD STANDARD.
	  01 REG-PELICULA.
	   02 COD-PELI PIC X(6).
	   02 TITULO PIC X(30).
	   02 GENERO PIC X(15).
	   02 DIRECTOR PIC X(25).
	   02 PRECIO PIC 9(4).
	   02 CLASE-PELICULA PIC 9.
	   02 DISPONIBLE PIC X.
	   
	 
	 WORKING-STORAGE SECTION.
	  77 ESTADO-ALQUILER PIC XX.
	  77 ESTADO-PELICULA PIC XX.
	  77 RES PIC X.
	   88 CORRECTOS VALUE 'S' 's' 'N' 'n'.
	  77 TECLA PIC 99.
	   88 ESC VALUE 27.
	   88 ABA VALUE 53.
	  77 ESPERA PIC X.
	  77 HAY-PELI PIC X.
	  77 PRESTADA PIC X.
	  77 CODIGO-PELICULA PIC X(6).
	  
	 SCREEN SECTION.
	  01 PANTALLA.   
	   02 FOREGROUND WHITE.
	   02 "N§ de salida:" COL 5 LINE 3.
	   02 "Fecha de alquiler: " COL 5 LINE 5.
	   02 PIC 9(2) USING DIA HIGHLIGHT.
	   02 "/" COL 26 LINE 5.
	   02 PIC 9(2) USING MES HIGHLIGHT.
	   02 "/" COL 29 LINE 5.
	   02 PIC 9(4) USING ANO HIGHLIGHT.
	   02 "C¢digo de socio: " COL 10 LINE 8.
	   02 PIC X(5) USING CODI-SOCIO HIGHLIGHT.
	   02 "C¢digo de pel¡cula: " COL 10 LINE 10.
	   02 PIC X(5) USING CODI-PELI HIGHLIGHT.
	   02 "Precio de Alquiler: " COL 10 LINE 12.
	   02 PIC 9(4) USING PRECI-ALQ HIGHLIGHT.
	   02 "Estado Actual de la pel¡cula: " COL 5 LINE 14.
	   02 PIC X USING PRESTADA.
	   
	   
	  01 AZUL.
	   02 BACKGROUND BLUE.
	   02 FOREGROUND WHITE.
	  01 NEGRO.
	   02 BACKGROUND BLACK.
	   
	PROCEDURE DIVISION.
	 INICIO.
	     MOVE ' ' TO PRESTADA.
	     PERFORM UNTIL ESC  
		MOVE 'S' TO HAY-PELI
		MOVE 0 TO TECLA 
		MOVE ' ' TO CODIGO-PELICULA
		DISPLAY NEGRO
		DISPLAY SPACES ERASE
		DISPLAY AZUL
		CALL "S-WINDOW" USING 03 77 02 18
		CANCEL "S-WINDOW"
		DISPLAY 'ALQUILERES' 
			POSITION 36 LINE 2 REVERSE
		DISPLAY PANTALLA
		PERFORM UNTIL CODIGO-PELICULA NOT EQUAL ' ' OR ESC 
			ACCEPT CODIGO-PELICULA NO BEEP POSITION 20 LINE 3
			ACCEPT TECLA FROM ESCAPE KEY
		END-PERFORM
		IF NOT ESC
		   MOVE CODIGO-PELICULA	TO COD-PELI
		   MOVE CODIGO-PELICULA TO CODI-PELI
		   OPEN I-O PELICULA
		   START PELICULA KEY = COD-PELI 
		   	INVALID KEY MOVE 'N' TO HAY-PELI
		   END-START
		   IF HAY-PELI = 'S'
		      READ PELICULA NEXT RECORD
		      IF DISPONIBLE = 'N'
		         OPEN I-O ALQUILER
		         START ALQUILER KEY = CODI-PELI
		         END-START
		         READ ALQUILER NEXT RECORD
		         DISPLAY PANTALLA
		         ACCEPT PANTALLA
			 IF PRESTADA = 'N'
			    DELETE ALQUILER
			    MOVE 'S' TO DISPONIBLE
			 END-IF
			 REWRITE REG-PELICULA
			 CLOSE PELICULA , ALQUILER
		      ELSE
			 DISPLAY PANTALLA
			 ACCEPT PANTALLA
			 IF PRESTADA = 'S'
			    MOVE 'N' TO DEVUELTA
			    WRITE REG-ALQUILER
			    MOVE 'N' TO DISPONIBLE
			 END-IF
			 REWRITE REG-PELICULA
			 CLOSE PELICULA , ALQUILER
		      END-IF	 
		   ELSE
		      PERFORM NO-HAY-FICHA
		   END-IF   
		END-IF
	     	MOVE 27 TO TECLA
	     END-PERFORM.
	     MOVE 0 TO TECLA.
	     DISPLAY NEGRO.
	     DISPLAY SPACES ERASE.
	     EXIT PROGRAM.
	 
	 
	 NO-HAY-FICHA.
	 	DISPLAY 'NO EXISTE LA PELICULA'
	 		POSITION 30 LINE 16 BLINK
	 	ACCEPT ESPERA.
