	IDENTIFICATION DIVISION.
	 PROGRAM-ID. MENU-LISTADOS.
	DATA DIVISION.
	 WORKING-STORAGE SECTION.
	  77 ESPERA PIC X.
	  77 TECLA PIC 99.
	   88 ESC VALUE 27.
	   88 ABA VALUE 53.
	   88 ARR VALUE 52.
	   88 ENT VALUE 13.
	  77 PPAL PIC 9.
	  77 OPCION PIC X.
	  77 ESPACIOS PIC X(73) VALUE ALL SPACES.
	 
	 SCREEN SECTION.
	  01 EN-SOCIOS.
	   02 FOREGROUND RED.
	   02 BACKGROUND GREEN.
	   02 'SOCIOS' COL 32 LINE 6.
	   02 FOREGROUND WHITE.
	   02 BACKGROUND BLUE.
	   02 'PELICULAS' COL 31 LINE 7.
	   02 'ALQUILERES' COL 30 LINE 8.
	   02 '<Esc> VOLVER' COL 29 LINE 9.
	    
	  01 EN-PELICULAS.
	   02 FOREGROUND RED.
	   02 BACKGROUND GREEN.
	   02 'PELICULAS' COL 31 LINE 7.
	   02 FOREGROUND WHITE.
	   02 BACKGROUND BLUE.
	   02 'SOCIOS' COL 32 LINE 6.
	   02 'ALQUILERES' COL 30 LINE 8.
	   02 '<Esc> VOLVER' COL 29 LINE 9.
	  
	  01 EN-ALQUILERES.
	   02 FOREGROUND RED.
	   02 BACKGROUND GREEN.
	   02 'ALQUILERES' COL 30 LINE 8.
	   02 FOREGROUND WHITE.
	   02 BACKGROUND BLUE.
	   02 'SOCIOS' COL 32 LINE 6.
	   02 'PELICULAS' COL 31 LINE 7.
	   02 '<Esc> VOLVER' COL 29 LINE 9.
	  
	  01 EN-VOLVER.
	   02 FOREGROUND RED.
	   02 BACKGROUND GREEN.
	   02 '<Esc> VOLVER' COL 29 LINE 9.
	   02 FOREGROUND WHITE.
	   02 BACKGROUND BLUE.
	   02 'SOCIOS' COL 32 LINE 6.
	   02 'PELICULAS' COL 31 LINE 7.
	   02 'ALQUILERES' COL 30 LINE 8.
	  
	  01 AYUDA1.
	   02 'Muestra un listado de los Socios del Video-club' 
		COL 18 LINE 23. 
	  
	  01 AYUDA2.
	   02 'Muestra un listado de todas las Pel¡culas' 
		COL 20 LINE 23. 
	  
	  01 AYUDA3.
	   02 '...Listado de Pel¡culas alquiladas (a Intervalos)' 
		COL 16 LINE 23. 
	  
	  01 AYUDA4.
	   02 'Volver al Men£ Principal' 
		COL 27 LINE 23. 
	  
	  
	  01 AZUL.
	   02 BACKGROUND BLUE.
	   02 FOREGROUND WHITE.

	  01 NEGRO.
	   02 BACKGROUND BLACK.
	   02 FOREGROUND WHITE.
	  

	 PROCEDURE DIVISION.
	  INICIO.
		MOVE 1 TO PPAL.
		MOVE 0 TO TECLA.
		PERFORM PONE-PANTALLA.
		PERFORM UNTIL ESC 
		   PERFORM RESALTA-OPCION
		   DISPLAY AZUL
		   PERFORM UNTIL ESC OR ENT OR ABA OR ARR 
			ACCEPT OPCION NO BEEP UPDATE 
				POSITION 70 LINE 23
			ACCEPT TECLA FROM ESCAPE KEY
		   END-PERFORM
		   IF ABA 
			COMPUTE PPAL = PPAL + 1
		   END-IF
		   IF ARR 
			COMPUTE PPAL = PPAL - 1
		   END-IF
		   IF PPAL > 4
			MOVE 1 TO PPAL
		   END-IF
		   IF PPAL < 1
			MOVE 4 TO PPAL
		   END-IF
		   PERFORM RESALTA-OPCION
		   IF ( PPAL = 1 AND ENT ) 
			MOVE 1 TO PPAL
			MOVE 0 TO TECLA
			PERFORM PONE-PANTALLA
		   END-IF
		   IF ( PPAL = 2 AND ENT )
			MOVE 2 TO PPAL
			MOVE 0 TO TECLA
			PERFORM PONE-PANTALLA
		   END-IF
		   IF ( PPAL = 3 AND ENT )
			MOVE 3 TO PPAL
			MOVE 0 TO TECLA
			PERFORM PONE-PANTALLA
		   END-IF
		   IF ( PPAL = 4 AND ENT )
			MOVE 27 TO TECLA
		   END-IF
		   IF NOT ESC 
			MOVE 0 TO TECLA
		   END-IF
		   MOVE ' ' TO OPCION
		END-PERFORM.
		EXIT PROGRAM.
	  
	  PONE-PANTALLA.
		  DISPLAY AZUL
		  CALL 'S-WINDOW' USING 27 42 05 10
		  CANCEL 'S-WINDOW'.

	  RESALTA-OPCION.
		IF PPAL = 1 
			DISPLAY EN-SOCIOS
			DISPLAY ESPACIOS POSITION 4 LINE 23
			DISPLAY AYUDA1
		END-IF. 
		IF PPAL = 2 
			DISPLAY EN-PELICULAS
			DISPLAY ESPACIOS POSITION 4 LINE 23
			DISPLAY AYUDA2
		END-IF.
		IF PPAL = 3 
			DISPLAY EN-ALQUILERES
			DISPLAY ESPACIOS POSITION 4 LINE 23
			DISPLAY AYUDA3
		END-IF.
		IF PPAL = 4 
			DISPLAY EN-VOLVER
			DISPLAY ESPACIOS POSITION 4 LINE 23
			DISPLAY AYUDA4
		END-IF.

