	IDENTIFICATION DIVISION.
	 PROGRAM-ID. VIDEO-CLUB.
	DATA DIVISION.
	 WORKING-STORAGE SECTION.
	  77 ESPERA PIC X.
	  77 TECLA PIC 99.
	   88 ESC VALUE 27.
	   88 ABA VALUE 53.
	   88 ARR VALUE 52.
	   88 ENT VALUE 13.
	  77 PPAL PIC 9.
	  77 OPCION PIC X.
	  77 ESPACIOS PIC X(73) VALUE ALL SPACES.


	 SCREEN SECTION.
	  01 PANTALLA-PPAL.
	   02 'MANTENIMIENTO' COL 10 LINE 5.
	   02 'LISTADOS' COL 30 LINE 5.
	   02 'UTILIDADES' COL 45 LINE 5.
	   02 'SALIR' COL 65 LINE 5.
	   02 FOREGROUND BROWN.
	   02 'GESTION DE VIDEO-CLUBS' COL 29 LINE 3.
	   02 BACKGROUND BLACK.
	   02 '²²² ²  ² ²²²² ²²²  ²²²  ²²²²' COL 6 LINE 13.
	   02 '²   ²  ² ²  ² ²  ² ²  ² ²  ²' COL 6 LINE 14.
	   02 '²   ²  ² ²  ² ² ²  ² ²  ²  ²' COL 6 LINE 15.
	   02 '²   ²²²² ²  ² ²²   ²²   ²  ²   ²² ²²² ²² ²²²' 
		COL 6 LINE 16.
	   02 '²   ²  ² ²  ² ² ²  ² ²  ²  ²  ²   ² ² ²   ²' 
		COL 6 LINE 17.
	   02 '²   ²  ² ²  ² ²  ² ²  ² ²  ²    ² ² ² ²²  ²' 
		COL 6 LINE 18.
	   02 '²²² ²  ² ²²²² ²  ² ²²²  ²²²²  ²²  ²²² ²   ² ²' 
		COL 6 LINE 19.
	   02 FOREGROUND WHITE.
	   02 BACKGROUND BLUE.
	   
	  01 AYUDA0.
	   02 'USE LAS FLECHAS (ARRIBA/ABAJO) Y ENTER' 
		COL 12 LINE 22. 
	   02 ' PARA ELEGIR OPCION'. 
	  
	  01 AYUDA1.
	   02 'Abre Men£ de Mantenimiento de Ficheros' 
		COL 22 LINE 23. 
	  
	  01 AYUDA2.
	   02 'Abre Men£ de listados de Ficheros' 
		COL 25 LINE 23. 
	  
	  01 AYUDA3.
	   02 'Abre Men£ de Utilidades (Borrado, devoluci¢n)' 
		COL 20 LINE 23. 
	  
	  01 AYUDA4.
	   02 'Salir al Sistema Operativo' 
		COL 28 LINE 23. 
	  
	  01 EN-MANTENIMIENTO.
	   02 FOREGROUND RED.
	   02 BACKGROUND GREEN.
	   02 'MANTENIMIENTO' COL 10 LINE 5.
	   02 FOREGROUND WHITE.
	   02 BACKGROUND BLUE.
	   02 'LISTADOS' COL 30 LINE 5.
	   02 'UTILIDADES' COL 45 LINE 5.
	   02 'SALIR' COL 65 LINE 5.
	    
	  01 EN-LISTADOS.
	   02 FOREGROUND RED.
	   02 BACKGROUND GREEN.
	   02 'LISTADOS' COL 30 LINE 5.
	   02 FOREGROUND WHITE.
	   02 BACKGROUND BLUE.
	   02 'MANTENIMIENTO' COL 10 LINE 5.
	   02 'UTILIDADES' COL 45 LINE 5.
	   02 'SALIR' COL 65 LINE 5.

	  01 EN-UTILIDADES.
	   02 FOREGROUND RED.
	   02 BACKGROUND GREEN.
	   02 'UTILIDADES' COL 45 LINE 5.
	   02 FOREGROUND WHITE.
	   02 BACKGROUND BLUE.
	   02 'MANTENIMIENTO' COL 10 LINE 5.
	   02 'LISTADOS' COL 30 LINE 5.
	   02 'SALIR' COL 65 LINE 5.
	  
	  01 EN-SALIR.
	   02 FOREGROUND RED.
	   02 BACKGROUND GREEN.
	   02 'SALIR' COL 65 LINE 5.
	   02 FOREGROUND WHITE.
	   02 BACKGROUND BLUE.
	   02 'MANTENIMIENTO' COL 10 LINE 5.
	   02 'LISTADOS' COL 30 LINE 5.
	   02 'UTILIDADES' COL 45 LINE 5.
	  
	  01 AZUL.
	   02 BACKGROUND BLUE.
	   02 FOREGROUND WHITE.

	  01 NEGRO.
	   02 BACKGROUND BLACK.
	   02 FOREGROUND WHITE.
	  





	 PROCEDURE DIVISION.
	  INICIO.
		MOVE 1 TO PPAL.
		MOVE 0 TO TECLA.
		PERFORM BORRADO.
		PERFORM PONE-PANTALLA.
		PERFORM UNTIL ESC 
		   PERFORM RESALTA-OPCION
		   DISPLAY AZUL
		   PERFORM UNTIL ESC OR ENT OR ABA OR ARR 
		      ACCEPT OPCION NO BEEP UPDATE 
			POSITION 70 LINE 23
		      ACCEPT TECLA FROM ESCAPE KEY
		   END-PERFORM
		   IF ABA 
			COMPUTE PPAL = PPAL + 1
		   END-IF
		   IF ARR 
			COMPUTE PPAL = PPAL - 1
		   END-IF
		   IF PPAL > 4
			MOVE 1 TO PPAL
		   END-IF
		   IF PPAL < 1
			MOVE 4 TO PPAL
		   END-IF
		   PERFORM RESALTA-OPCION
		   IF ( PPAL = 1 AND ENT ) 
			CALL 'MENU-MAN'
			CANCEL 'MENU-MAN'
			MOVE 1 TO PPAL
			MOVE 0 TO TECLA
			PERFORM PONE-PANTALLA
		   END-IF
		   IF ( PPAL = 2 AND ENT )
			MOVE 2 TO PPAL
			MOVE 0 TO TECLA
			CALL 'MENU-LIS'
			CANCEL 'MENU-LIS'
			PERFORM PONE-PANTALLA
		   END-IF
		   IF ( PPAL = 3 AND ENT )
			MOVE 3 TO PPAL
			MOVE 0 TO TECLA
			PERFORM PONE-PANTALLA
		   END-IF
		   IF ( PPAL = 4 AND ENT )
			MOVE 27 TO TECLA
		   END-IF
		   IF NOT ESC 
			MOVE 0 TO TECLA
		   END-IF
		   MOVE ' ' TO OPCION
		END-PERFORM.
		STOP RUN.
	  
	  PONE-PANTALLA.
		  PERFORM BORRADO
		  DISPLAY AZUL
		  CALL 'S-WINDOW' USING 03 77 02 06
		  CANCEL 'S-WINDOW'
		  DISPLAY PANTALLA-PPAL
		  DISPLAY AZUL
		  CALL 'S-WINDOW' USING 03 77 21 24
		  CANCEL 'S-WINDOW'
		  DISPLAY 'AYUDA' POSITION 37 LINE 21 REVERSE
		  DISPLAY AYUDA0.

	 BORRADO.
		  DISPLAY NEGRO
		  DISPLAY ' ' ERASE.

       RESALTA-OPCION.
		IF PPAL = 1 
			DISPLAY EN-MANTENIMIENTO
			DISPLAY ESPACIOS POSITION 4 LINE 23
			DISPLAY AYUDA1
		END-IF. 
		IF PPAL = 2 
			DISPLAY EN-LISTADOS
			DISPLAY ESPACIOS POSITION 4 LINE 23
			DISPLAY AYUDA2
		END-IF.
		IF PPAL = 3 
			DISPLAY EN-UTILIDADES
			DISPLAY ESPACIOS POSITION 4 LINE 23
			DISPLAY AYUDA3
		END-IF.
		IF PPAL = 4 
			DISPLAY EN-SALIR
			DISPLAY ESPACIOS POSITION 4 LINE 23
			DISPLAY AYUDA4
		END-IF.

